{
  "main": {
    "about": {
      "title": {
        "main": "Теперь немного о личном!",
        "python": "А <span class=\"italic\">ты</span> говоришь на универсальном <span class=\"text-yellow-500\">языке</span> современного программиста?"
      }
    },
    "contact": {
      "title": "Контакты"
    },
    "current": {
      "current": {
        "available": "<span class=\"text-green-500 font-semibold\">Доступен</span>",
        "body": "В настоящее время я обучаюсь на бакалавриате инженерии в Восточно-Средиземноморском университете, Кипр.",
        "maybe": "<span class=\"text-primary font-semibold\">Возможно доступен</span>",
        "not_available": "<span class=\"text-destructive font-semibold\">Недоступен</span>",
        "offer_label": "Статус предложений",
        "title": "Текущий статус"
      },
      "title": "Больше обо мне"
    },
    "drawer": {
      "exit": "Выйти"
    },
    "featuring": {
      "docker": "Docker — незаменимый инструмент для администрирования систем. Я использую его для повышения безопасности за счёт контейнеризации, а также для управления несколькими сессиями.",
      "fastapi": "FastAPI — мой любимый фреймворк благодаря множеству функций и высокой производительности, особенно из-за авто-документации OpenAPI.",
      "hetzner": "Hetzner — мой облачный провайдер благодаря ценам, техническим характеристикам и расположению серверов в Европе.",
      "javascript": "Я использую JavaScript/TypeScript с Svelte, а также для скриптов, тестирования смарт-контрактов и разработки бэкенда на Express.",
      "linux": "Как разработчик, увлечённый кроссплатформенностью, я использую dual-boot Linux и Windows, при этом Linux — мой основной выбор. Windows дополняет работу при необходимости. У меня есть опыт настройки и администрирования личных Linux-серверов.",
      "python": "Python — инструмент, который я использую ежедневно. Скрипты и бэкенд — лишь часть примеров. Я считаю, что это один из важнейших активов для компании благодаря простоте обучения и использования.",
      "rust": "Благодаря строгой системе типов и высокой производительности на низком уровне, Rust — один из инструментов, который я применяю для разработки бэкенда и приложений.",
      "solidity": "Solidity с Hardhat — мой выбор для разработки смарт-контрактов. Несмотря на уважение к его возможностям, сам язык мне не особенно нравится.",
      "svelte": "Svelte — первый front-end фреймворк, к которому я обращаюсь. У него есть всё, что мне нужно — и даже больше.",
      "title": "Мой набор инструментов!"
    },
    "scroll_butt": "Показать больше",
    "title": "Привет! Я {name},",
    "titles": {
      "option1": "разработчик программного обеспечения",
      "option2": "энтузиаст Linux",
      "option3": "домашний повар",
      "option4": "бэкенд-разработчик",
      "option5": "твой будущий коллега",
      "option6": "фанат изучения языков",
      "option7": "любопытный пентестер",
      "option8": "пользователь Arch",
      "option9": "энтузиаст open source!",
      "option10": "full stack разработчик"
    }
  }
}
